{"data":{"markdownRemark":{"frontmatter":{"title":"Introduction to JavaScript","date":"06 April 2019","path":"/introduction-to-javascript","author":"Ebn Sina","excerpt":"Programming is the act of constructing a program—a set of precise instructions telling a computer what to do..","tags":["js"],"coverImage":{"childImageSharp":{"fluid":{"base64":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAUCAIAAAAC64paAAAACXBIWXMAAAsSAAALEgHS3X78AAAB/0lEQVQ4y2P4eCeYbMTw4bYf2Qio2Z9sNKoZFX28A0IQ9vtbIPanuyAGEBHWjKzu15PAtzf8n1/2+/4w8Ov9AIg4A1Y9n+8FPL3omxxnUZBl9QlkYcDCqU5B/qae7iZl+dbXj3p/uQfSj13zl/sBD8/5GhoZODka/3kWuHW5q6KKLpAdHWEuLa/TUGH783Hgu5u4NN8Daba2NvTyMPn/Mqi93k5WQXfLcrf/H4J3rXZ7dM4X6HmczoZotrQyBLrz3/PAJTOcZRV1Q4PMgE74/jjw19PA9zdxaH57E6HZ29MEyH5z3a8wy0peSRdohJ+P6YGN7t8fBWBx9rtboPgAhtD9M75WVoY+XibAAPv6IODnk8BtK1xT4i1U1HXNzAyvHvb+9iCAAc3BPx8HPL3k+/tJ4Otr/lZgm4GKnl/2vXLY+//7YCBqr7MDhtnSmc7AgERoBjrjx6OA5bOczcwNF0xxWjzdWVldLynWAuiQiBAzfQODRdOcD2/2SIo1Bwbe1uVuQAtQNAN9snO1m7m5gYy8jqyCjrGJwc5VbkAbgAFmbmEItFBGQVdBWbcw2+rtTT9ggkN39q/HAXfP+Kxd4LJyjvOVQ17fHoISAzB53Tvts3Gxy7JZzgc3eny87f8ZnE4xAuwmKHkBfQ70AjCpvANHCTBhfroHEoGgd7BkCwCEs/ahEv1v6gAAAABJRU5ErkJggg==","aspectRatio":1,"src":"/static/0cded3a3276425911d55a2552bf361bf/a3fa0/js.png","srcSet":"/static/0cded3a3276425911d55a2552bf361bf/e7c66/js.png 200w,\n/static/0cded3a3276425911d55a2552bf361bf/140ea/js.png 400w,\n/static/0cded3a3276425911d55a2552bf361bf/a3fa0/js.png 800w,\n/static/0cded3a3276425911d55a2552bf361bf/bca59/js.png 1052w","sizes":"(max-width: 800px) 100vw, 800px"}}}},"id":"34c0b937-6dd0-503c-ace8-182964f1c19e","html":"<h2>Introduction</h2>\n<blockquote>\n<p>We think we are creating the system for our own purposes. We believe we are making it in our own image... But the computer is not really like us. It is a projection of a very slim part of ourselves: that portion devoted to logic, order, rule, and clarity.</p>\n<ul>\n<li>Ellen Ullman, Close to the Machine: Technophilia and its Discontents</li>\n</ul>\n</blockquote>\n<p>This is a book about instructing computers. Computers are about as common as screwdrivers today, but they are quite a bit more complex, and making them do what you want them to do isn’t always easy.</p>\n<p>If the task you have for your computer is a common, well-understood one, such as showing you your email or acting like a calculator, you can open the appropriate application and get to work. But for unique or open-ended tasks, there probably is no application.</p>\n<p>That is where programming may come in. Programming is the act of constructing a program—a set of precise instructions telling a computer what to do. Because computers are dumb, pedantic beasts, programming is fundamentally tedious and frustrating.</p>\n<p>Fortunately, if you can get over that fact, and maybe even enjoy the rigor of thinking in terms that dumb machines can deal with, programming can be rewarding. It allows you to do things in seconds that would take forever by hand. It is a way to make your computer tool do things that it couldn’t do before. And it provides a wonderful exercise in abstract thinking.</p>\n<p>Most programming is done with programming languages. A programming language is an artificially constructed language used to instruct computers. It is interesting that the most effective way we’ve found to communicate with a computer borrows so heavily from the way we communicate with each other. Like human languages, computer languages allow words and phrases to be combined in new ways, making it possible to express ever new concepts.</p>\n<p>At one point language-based interfaces, such as the BASIC and DOS prompts of the 1980s and 1990s, were the main method of interacting with computers. They have largely been replaced with visual interfaces, which are easier to learn but offer less freedom. Computer languages are still there, if you know where to look. One such language, JavaScript, is built into every modern web browser and is thus available on almost every device.</p>\n<p>This book will try to make you familiar enough with this language to do useful and amusing things with it.</p>\n<h3>On programming</h3>\n<p>Besides explaining JavaScript, I will introduce the basic principles of programming. Programming, it turns out, is hard. The fundamental rules are simple and clear, but programs built on top of these rules tend to become complex enough to introduce their own rules and complexity. You’re building your own maze, in a way, and you might just get lost in it.</p>\n<p>There will be times when reading this book feels terribly frustrating. If you are new to programming, there will be a lot of new material to digest. Much of this material will then be combined in ways that require you to make additional connections.</p>\n<p>It is up to you to make the necessary effort. When you are struggling to follow the book, do not jump to any conclusions about your own capabilities. You are fine—you just need to keep at it. Take a break, reread some material, and make sure you read and understand the example programs and exercises. Learning is hard work, but everything you learn is yours and will make subsequent learning easier.</p>\n<blockquote>\n<p>When action grows unprofitable, gather information; when information grows unprofitable, sleep.</p>\n<ul>\n<li>Ursula K. Le Guin, The Left Hand of Darkness</li>\n</ul>\n</blockquote>\n<p>A program is many things. It is a piece of text typed by a programmer, it is the directing force that makes the computer do what it does, it is data in the computer’s memory, yet it controls the actions performed on this same memory. Analogies that try to compare programs to objects we are familiar with tend to fall short. A superficially fitting one is that of a machine—lots of separate parts tend to be involved, and to make the whole thing tick, we have to consider the ways in which these parts interconnect and contribute to the operation of the whole.</p>\n<p>A computer is a physical machine that acts as a host for these immaterial machines. Computers themselves can do only stupidly straightforward things. The reason they are so useful is that they do these things at an incredibly high speed. A program can ingeniously combine an enormous number of these simple actions to do very complicated things.</p>\n<p>A program is a building of thought. It is costless to build, it is weightless, and it grows easily under our typing hands.</p>\n<p>But without care, a program’s size and complexity will grow out of control, confusing even the person who created it. Keeping programs under control is the main problem of programming. When a program works, it is beautiful. The art of programming is the skill of controlling complexity. The great program is subdued—made simple in its complexity.</p>\n<p>Some programmers believe that this complexity is best managed by using only a small set of well-understood techniques in their programs. They have composed strict rules (“best practices”) prescribing the form programs should have and carefully stay within their safe little zone.</p>\n<p>This is not only boring, it is ineffective. New problems often require new solutions. The field of programming is young and still developing rapidly, and it is varied enough to have room for wildly different approaches. There are many terrible mistakes to make in program design, and you should go ahead and make them so that you understand them. A sense of what a good program looks like is developed in practice, not learned from a list of rules.</p>","excerpt":"Introduction We think we are creating the system for our own purposes. We believe we are making it in our own image... But the computer is…"}},"pageContext":{"isCreatedByStatefulCreatePages":false,"type":"posts","next":{"frontmatter":{"path":"/why-language-matter","title":"Why Language Matter","tags":["programming"]},"fileAbsolutePath":"/Users/ebnsina/Downloads/es-blog/src/posts/why-language-matter.md"},"previous":null}}